ian-ross/efm8-unbricker/brick-it/efm8ub3.h
// IP (Interrupt Priority)
__sbit __at (0xB8) IP_PX0;    // External Interrupt 0 Priority Control LSB
__sbit __at (0xB9) IP_PT0;    // Timer 0 Interrupt Priority Control LSB
__sbit __at (0xBA) IP_PX1;    // External Interrupt 1 Priority Control LSB
__sbit __at (0xBB) IP_PT1;    // Timer 1 Interrupt Priority Control LSB
__sbit __at (0xBC) IP_PS1;    // UART1 Interrupt Priority Control LSB
__sbit __at (0xBD) IP_PT2;    // Timer 2 Interrupt Priority Control LSB
__sbit __at (0xBE) IP_PSPI0; // Serial Peripheral Interface (SPI0) Interrupt Priority Control LSB

// P0 (Port 0 Pin Latch)
__sbit __at (0x80) P0_B0;       // Port 0 Bit 0 Latch
__sbit __at (0x81) P0_B1;       // Port 0 Bit 1 Latch
__sbit __at (0x82) P0_B2;       // Port 0 Bit 2 Latch
__sbit __at (0x83) P0_B3;       // Port 0 Bit 3 Latch
__sbit __at (0x84) P0_B4;       // Port 0 Bit 4 Latch
__sbit __at (0x85) P0_B5;       // Port 0 Bit 5 Latch
__sbit __at (0x86) P0_B6;       // Port 0 Bit 6 Latch
__sbit __at (0x87) P0_B7;       // Port 0 Bit 7 Latch

// P1 (Port 1 Pin Latch)
__sbit __at (0x90) P1_B0;       // Port 1 Bit 0 Latch
__sbit __at (0x91) P1_B1;       // Port 1 Bit 1 Latch
__sbit __at (0x92) P1_B2;       // Port 1 Bit 2 Latch
__sbit __at (0x93) P1_B3;       // Port 1 Bit 3 Latch
__sbit __at (0x94) P1_B4;       // Port 1 Bit 4 Latch
__sbit __at (0x95) P1_B5;       // Port 1 Bit 5 Latch
__sbit __at (0x96) P1_B6;       // Port 1 Bit 6 Latch
__sbit __at (0x97) P1_B7;       // Port 1 Bit 7 Latch

// P2 (Port 2 Pin Latch)
__sbit __at (0xA0) P2_B0;       // Port 2 Bit 0 Latch
__sbit __at (0xA1) P2_B1;       // Port 2 Bit 1 Latch

// PCA0CN0 (PCA Control)
__sbit __at (0xD8) PCA0CN0_CCF0; // PCA Module 0 Capture/Compare Flag
__sbit __at (0xD9) PCA0CN0_CCF1; // PCA Module 1 Capture/Compare Flag
__sbit __at (0xDA) PCA0CN0_CCF2; // PCA Module 2 Capture/Compare Flag
__sbit __at (0xDE) PCA0CN0_CR;   // PCA Counter/Timer Run Control
__sbit __at (0xDF) PCA0CN0_CF;   // PCA Counter/Timer Overflow Flag

// PSW (Program Status Word)
__sbit __at (0xD0) PSW_PARITY;  // Parity Flag
__sbit __at (0xD1) PSW_F1;      // User Flag 1
__sbit __at (0xD2) PSW_OV;      // Overflow Flag
__sbit __at (0xD3) PSW_RS0;     // Register Bank Select Bit 0
__sbit __at (0xD4) PSW_RS1;     // Register Bank Select Bit 1
__sbit __at (0xD5) PSW_F0;      // User Flag 0
__sbit __at (0xD6) PSW_AC;      // Auxiliary Carry Flag
__sbit __at (0xD7) PSW_CY;      // Carry Flag

// SCON1 (UART1 Serial Port Control)
__sbit __at (0x98) SCON1_RI;    // Receive Interrupt Flag
__sbit __at (0x99) SCON1_TI;    // Transmit Interrupt Flag
__sbit __at (0x9A) SCON1_RBX;   // Extra Receive Bit
__sbit __at (0x9B) SCON1_TBX;   // Extra Transmission Bit
__sbit __at (0x9C) SCON1_REN;   // Receive Enable
__sbit __at (0x9E) SCON1_PERR;  // Parity Error Flag
__sbit __at (0x9F) SCON1_OVR;   // Receive FIFO Overrun Flag

// SMB0CN0 (SMBus 0 Control)
__sbit __at (0xC0) SMB0CN0_SI;      // SMBus Interrupt Flag
__sbit __at (0xC1) SMB0CN0_ACK;     // SMBus Acknowledge
__sbit __at (0xC2) SMB0CN0_ARBLOST; // SMBus Arbitration Lost Indicator
__sbit __at (0xC3) SMB0CN0_ACKRQ;   // SMBus Acknowledge Request
__sbit __at (0xC4) SMB0CN0_STO;     // SMBus Stop Flag
__sbit __at (0xC5) SMB0CN0_STA;     // SMBus Start Flag
__sbit __at (0xC6) SMB0CN0_TXMODE;  // SMBus Transmit Mode Indicator
__sbit __at (0xC7) SMB0CN0_MASTER;  // SMBus Master/Slave Indicator

// SPI0CN0 (SPI0 Control)
__sbit __at (0xF8) SPI0CN0_SPIEN;  // SPI0 Enable
__sbit __at (0xF9) SPI0CN0_TXNF;   // TX FIFO Not Full
__sbit __at (0xFA) SPI0CN0_NSSMD0; // Slave Select Mode Bit 0
__sbit __at (0xFB) SPI0CN0_NSSMD1; // Slave Select Mode Bit 1
__sbit __at (0xFC) SPI0CN0_RXOVRN; // Receive Overrun Flag
__sbit __at (0xFD) SPI0CN0_MODF;   // Mode Fault Flag
__sbit __at (0xFE) SPI0CN0_WCOL;   // Write Collision Flag
__sbit __at (0xFF) SPI0CN0_SPIF;   // SPI0 Interrupt Flag

// TCON (Timer 0/1 Control)
__sbit __at (0x88) TCON_IT0;    // Interrupt 0 Type Select
__sbit __at (0x89) TCON_IE0;    // External Interrupt 0
__sbit __at (0x8A) TCON_IT1;    // Interrupt 1 Type Select
__sbit __at (0x8B) TCON_IE1;    // External Interrupt 1
__sbit __at (0x8C) TCON_TR0;    // Timer 0 Run Control
__sbit __at (0x8D) TCON_TF0;    // Timer 0 Overflow Flag
__sbit __at (0x8E) TCON_TR1;    // Timer 1 Run Control
__sbit __at (0x8F) TCON_TF1;    // Timer 1 Overflow Flag

// TMR2CN0 (Timer 2 Control 0)
__sbit __at (0xC8) TMR2CN0_T2XCLK0; // Timer 2 External Clock Select Bit 0
__sbit __at (0xC9) TMR2CN0_T2XCLK1; // Timer 2 External Clock Select Bit 1
__sbit __at (0xCA) TMR2CN0_TR2;     // Timer 2 Run Control
__sbit __at (0xCB) TMR2CN0_T2SPLIT; // Timer 2 Split Mode Enable
__sbit __at (0xCC) TMR2CN0_TF2CEN;  // Timer 2 Capture Enable
__sbit __at (0xCD) TMR2CN0_TF2LEN;  // Timer 2 Low Byte Interrupt Enable
__sbit __at (0xCE) TMR2CN0_TF2L;    // Timer 2 Low Byte Overflow Flag
__sbit __at (0xCF) TMR2CN0_TF2H;    // Timer 2 High Byte Overflow Flag

// TMR4CN0 (Timer 4 Control 0)
__sbit __at (0x98) TMR4CN0_T4XCLK0; // Timer 4 External Clock Select Bit 0
__sbit __at (0x99) TMR4CN0_T4XCLK1; // Timer 4 External Clock Select Bit 1
__sbit __at (0x9A) TMR4CN0_TR4;     // Timer 4 Run Control
__sbit __at (0x9B) TMR4CN0_T4SPLIT; // Timer 4 Split Mode Enable
__sbit __at (0x9C) TMR4CN0_TF4CEN;  // Timer 4 Capture Enable
__sbit __at (0x9D) TMR4CN0_TF4LEN;  // Timer 4 Low Byte Interrupt Enable
__sbit __at (0x9E) TMR4CN0_TF4L;    // Timer 4 Low Byte Overflow Flag
__sbit __at (0x9F) TMR4CN0_TF4H;    // Timer 4 High Byte Overflow Flag

// TMR5CN0 (Timer 5 Control 0)
__sbit __at (0xC0) TMR5CN0_T5XCLK0; // Timer 5 External Clock Select Bit 0
__sbit __at (0xC1) TMR5CN0_T5XCLK1; // Timer 5 External Clock Select Bit 1
__sbit __at (0xC2) TMR5CN0_TR5;     // Timer 5 Run Control
__sbit __at (0xC3) TMR5CN0_T5SPLIT; // Timer 5 Split Mode Enable
__sbit __at (0xC4) TMR5CN0_TF5CEN;  // Timer 5 Capture Enable
__sbit __at (0xC5) TMR5CN0_TF5LEN;  // Timer 5 Low Byte Interrupt Enable
__sbit __at (0xC6) TMR5CN0_TF5L;    // Timer 5 Low Byte Overflow Flag
__sbit __at (0xC7) TMR5CN0_TF5H;    // Timer 5 High Byte Overflow Flag

