ian-ross/efm8-unbricker/brick-it/efm8ub3.h
// UART1FCN1 (UART1 FIFO Control 1)
__sbit __at (0xD8) UART1FCN1_RIE;    // Receive Interrupt Enable
__sbit __at (0xD9) UART1FCN1_RXTO0;  // Receive Timeout Bit 0
__sbit __at (0xDA) UART1FCN1_RXTO1;  // Receive Timeout Bit 1
__sbit __at (0xDB) UART1FCN1_RFRQ;   // Receive FIFO Request
__sbit __at (0xDC) UART1FCN1_TIE;    // Transmit Interrupt Enable
__sbit __at (0xDD) UART1FCN1_TXHOLD; // Transmit Hold
__sbit __at (0xDE) UART1FCN1_TXNF;   // TX FIFO Not Full
__sbit __at (0xDF) UART1FCN1_TFRQ;   // Transmit FIFO Request

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn    0          // External Interrupt 0
#define TIMER0_IRQn  1          // Timer 0 Overflow
#define INT1_IRQn    2          // External Interrupt 1
#define TIMER1_IRQn  3          // Timer 1 Overflow
#define UART1_IRQn   4          // UART1
#define TIMER2_IRQn  5          // Timer 2 Overflow / Capture
#define SPI0_IRQn    6          // SPI0
#define SMBUS0_IRQn  7          // SMBus 0
#define PMATCH_IRQn  8          // Port Match
#define ADC0WC_IRQn  9          // ADC0 Window Compare
#define ADC0EOC_IRQn 10         // ADC0 End of Conversion
#define PCA0_IRQn    11         // PCA0
#define CMP0_IRQn    12         // Comparator 0
#define CMP1_IRQn    13         // Comparator 1
#define TIMER3_IRQn  14         // Timer 3 Overflow / Capture
#define USB0_IRQn    15         // USB0 Events
#define VBUS_IRQn    16         // VBUS / USB Charge Detect
#define TIMER4_IRQn  17         // Timer 4 Overflow / Capture
#define TIMER5_IRQn  18         // Timer 5 Overflow / Capture
#define CL0_IRQn     21         // Configurable Logic

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define CRC0_PAGE      0x00     // CRC0 Page
#define LEGACY_PAGE    0x00     // Legacy SFR Page
#define PCA0_PAGE      0x00     // PCA0 Page
#define PG2_PAGE       0x10     // Page2
#define TIMER2_PAGE    0x10     // Timer 2 Page
#define TIMER3_PAGE    0x10     // Timer 3 Page
#define TIMER4_PAGE    0x10     // Timer 4 Page
#define TIMER5_PAGE    0x10     // Timer 5 Page
#define I2CSLAVE0_PAGE 0x20     // I2C Slave 0 Page
#define PG3_PAGE       0x20     // Page3
#define SMB0_PAGE      0x20     // SMBus 0 Page
#define SPI0_PAGE      0x20     // SPI0 Page
#define UART1_PAGE     0x20     // UART1 Page
#define USB0_PAGE      0x20     // USB0 Page

#endif // EFM8UB3_H
